{"backend": "tensorflow", "keras_version": "2.1.6", "config": [{"config": {"activation": "relu", "kernel_regularizer": null, "bias_regularizer": null, "name": "conv2d_1", "bias_constraint": null, "batch_input_shape": [null, 50, 50, 3], "dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "strides": [1, 1], "filters": 36, "dtype": "float32", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "use_bias": true, "data_format": "channels_last", "padding": "valid", "kernel_constraint": null, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "name": "max_pooling2d_1", "trainable": true, "data_format": "channels_last", "padding": "valid", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"activation": "relu", "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "strides": [2, 2], "trainable": true, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 72, "kernel_constraint": null, "name": "conv2d_2", "padding": "valid", "data_format": "channels_last", "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "name": "max_pooling2d_2", "trainable": true, "data_format": "channels_last", "padding": "valid", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "data_format": "channels_last", "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"activation": "relu", "kernel_regularizer": null, "units": 256, "bias_regularizer": null, "bias_constraint": null, "name": "dense_1", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}], "class_name": "Sequential"}